{"_id":{"$oid":"64e5c7b58a10ef8ad36d7025"},"id":100010,"name":"THE LONGINES MASTER COLLECTION","category":"Watchmaking tradition","description":"As a traditional watchmaking company, Longines has been producing exceptional timepieces since the very beginning. Today, the Longines Master Collection is the perfect illustration of this corporate ethos, as can be seen from the success enjoyed by this range since it was launched in 2005.","brandId":220020,"type":["Classic"]}
{"_id":{"$oid":"64e5c7c78a10ef8ad36d7026"},"id":100020,"name":"RECORD COLLECTION","category":"Watchmaking tradition","description":"In Longines’ purest watchmaking tradition, the Record automatic models combine classic elegance and excellence, aspiring to become the spearheads of the brand. And there is no shortage of arguments for these exceptional timepieces, whose movement includes a single-crystal silicon balance spring with unique properties.","brandId":220020,"type":["Classic"]}
{"_id":{"$oid":"64e5c7c88a10ef8ad36d7027"},"id":100030,"name":"HERITAGE CLASSIC","category":"Watchmaking tradition","description":"Longines combines the original aesthetics of its most remarkable historic models with the most modern watchmaking techniques. Heritage Classic pieces are a tribute to the innovative spirit that has driven Longines’ watchmakers from the outset. Longines timepieces draw from this expertise and illustrate the durability that is the brand’s signature, as well a consistent desire to honor history.","brandId":220020,"type":["Classic"]}
{"_id":{"$oid":"64e5c7c88a10ef8ad36d7028"},"id":100040,"name":"FLAGSHIP","category":"Watchmaking tradition","description":"The launch of the first Flagship by Longines in 1957 was met with resounding success. Today, this timeless collection can still be found in the brand's range of products in a reworked form. Each fitted with a self-winding calibre, these models will enchant lovers of classic, robust watches. A wide range of dials and a selection of sizes mean that everyone can find the watch that suits him or her.","brandId":220020,"type":["Classic"]}
{"_id":{"$oid":"64e5c7d48a10ef8ad36d7029"},"id":100050,"name":"LONGINES DOLCEVITA","category":"Elegance","description":"Since its inception, the Longines DolceVita collection has illustrated contemporary elegance of the Longines watchmaking brand worldwide. Inspired by the 'Dolce Vita', it is an homage to the sweetness of life. Today, a new chapter in this collection opens with a unique interpretation featuring softened lines. These new variations will not fail to impress women who have made charm a way of life.","brandId":220020,"type":["Classic"]}
{"_id":{"$oid":"64e5c7d48a10ef8ad36d702a"},"id":100060,"name":"THE LONGINES ELEGANT COLLECTION","category":"Elegance","description":"Since its earliest days, Longines has always focused on elegance. This quality can be found not only in its products but also in its communication, with the now famous slogan 'Elegance is an attitude'. So it comes as no surprise that the brand is now launching the Longines Elegant Collection, which comprises models that are the perfect embodiment of the classical design and sleek lines typical of Longines timepieces.","brandId":220020,"type":["Classic"]}
{"_id":{"$oid":"64e5c7d48a10ef8ad36d702b"},"id":100070,"name":"LA GRANDE CLASSIQUE DE LONGINES","category":"Elegance","description":"Launched in 1992, La Grande Classique de Longines has played a major role in forging the reputation of the winged hourglass brand. This range is a symbol of Longines’ classic elegance and timeless sophistication, and stands out thanks to its very slim profile and wide palette of versions.","brandId":220020,"type":["Classic"]}
{"_id":{"$oid":"64e5c7d58a10ef8ad36d702c"},"id":100080,"name":"LONGINES PRIMALUNA","category":"Elegance","description":"A silvery moon on a spring night; a star that glistens reaches its peak and then disappears. A symbol of passing time, living time and the moon that entrances us with its rounded, delicate lines the Longines PrimaLuna is a tribute to this silvery star. Its soft silhouette is enhanced by the exquisite purity of the dial and the whole is illuminated by a play of sparkling diamonds.","brandId":220020,"type":["Classic"]}
{"_id":{"$oid":"64e5c7e28a10ef8ad36d702d"},"id":100090,"name":"LONGINES EVIDENZA","category":"Elegance","description":"Who could forget the 1920s? It was a time of rapid change throughout the world, starting with important progress in many areas, as well as an incredible degree of freedom for artists, and of course stylists too. Fashion and design threw off rigid, centuries-old rules while personal accessories of every description grew increasingly handy, compact and stylish.","brandId":220020,"type":["Classic"]}
{"_id":{"$oid":"64e5c7e38a10ef8ad36d702e"},"id":100100,"name":"CONQUEST CLASSIC","category":"Performance","description":"As a partner of many of the most prestigious sports events in the world, Longines was keen to launch a collection of timepieces to be worn amidst the excitement of these competitions. As a tribute to the chronographs produced from 1878 on, the famous Swiss watchmaker presents the Conquest Classic line.","brandId":220020,"type":["Sport"]}
{"_id":{"$oid":"64e5c7e38a10ef8ad36d702f"},"id":100110,"name":"CONQUEST","category":"Performance","description":"Without sacrificing elegance, the Conquest line perpetuates the spirit of conquest of all those who have dared to go further than others in their quest for new horizons. The same spirit has been behind the models in the Conquest collection since 1954. Each watch contains a subtle fusion of performance and elegance, including the most demanding technical features.","brandId":220020,"type":["Sport"]}
{"_id":{"$oid":"64e5c7e38a10ef8ad36d7030"},"id":100120,"name":"LONGINES SPIRIT","category":"Avigation","description":"Historically, Longines has accompanied legendary pioneers as they conquer air, land and sea. Today, the winged hourglass brand has drawn inspiration from this heritage to create Longines Spirit, a collection with an impeccable pedigree.","brandId":220020,"type":["Sport"]}
{"_id":{"$oid":"64e5c7ed8a10ef8ad36d7031"},"id":100130,"name":"HERITAGE AVIGATION","category":"Avigation","description":"Longines continues to keep a close and long-standing connection with the world of aviation. The brand has produced a large number of pilots' watches and chronographs, on-board equipment and other navigation instruments which aided the development of civil and military aviation during the first half of the 20th century. Today, Longines is bringing this exciting heritage back to life with watches from its 'Heritage Avigation' range.","brandId":220020,"type":["Sport"]}
{"_id":{"$oid":"64e5c7ed8a10ef8ad36d7032"},"id":100140,"name":"HYDROCONQUEST","category":"Diving","description":"Founded in 1832 in Saint-Imier, the famous Swiss watch brand Longines can boast a long tradition characterised by the elegance and performance of its products. Those values are perfectly represented by The Longines Sport Collection. The HydroConquest line is dedicated to men and women looking for a high performance timepiece that combines technical innovation and elegance.","brandId":220020,"type":["Sport"]}
{"_id":{"$oid":"64e5c7ed8a10ef8ad36d7033"},"id":100150,"name":"THE LONGINES LEGEND DIVER WATCH","category":"Diving","description":"A reinterpretation of a 1960s diver watch, The Longines Legend Diver occupies a special place in the brand’s Heritage segment. Symbolic of the rich heritage of Longines, this range has gradually expanded over the year.","brandId":220020,"type":["Sport"]}
{"_id":{"$oid":"64e5c7ee8a10ef8ad36d7034"},"id":100160,"name":"LONGINES ULTRA-CHRON","category":"Diving","description":"Inspired by the original Longines Ultra-Chron Diver of 1968, the new model and its new high-frequency calibre represent the first reinterpretation of what sets Longines apart – its status as a pioneer in the world of sports timing.","brandId":220020,"type":["Sport"]}
